# RebarHookRotationAtEndSchedulesTagsFilters Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarHookRotationAtEndSchedulesTagsFilters Property
ParameterTypeId Class See Also
---
"Hook Rotation At End"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarHookRotationAtEndSchedulesTagsFilters { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarHookRotationAtEndSchedulesTagsFilters As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarHookRotationAtEndSchedulesTagsFilters {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace